---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningRectDoesnotCutHost
source: html/58b6294e-242f-135b-e278-47ff5171f795.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningRectDoesnotCutHost Property

Rectangular opening doesn't cut its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpeningRectDoesnotCutHost { get; }
```